# TODO: 1 аргумент программы - файл (обязательный, содержит путь до файла, в который будут сохраняться данные).

# TODO: 2 аргумент программы - рубрика (необязательный, фильтрует статьи по рубрике,
#  может быть либо news, либо articles. Если не указан, должны собираться все статьи (news + articles)).

# TODO: 3 аргумент программы - дата (необязательный, фильтрует статьи по дате).

# TODO: пример запуска программы: python lenta_ru.py --file="/home/Ivanov/crawler/data/lenta_ru.pkl" --rubric="news"
#  --date="2020.01.28"

# TODO: для каждой новости собрать ссылку

# TODO: для каждой новости собрать заголовок

# TODO: для каждой новости собрать дату

# TODO: собрать тело новости


if __name__ == "__main__":
    pass
